## 计网上机实验报告

### 1. 拓扑图

![](https://raw.githubusercontent.com/CaesarRoot/Mango/master/实验报告图片.png)



### 2. 实验步骤

设定：

```
右上的三个路由器，从左到右分别为 R1 ，R2 ， R3
交换机从左到右分别为 sw1 , sw2
```



#### 2.1 VLAN配置

将 SW1 和 SW2 之间的链路设置为 Trunk 链路

```cmd
sw1(config)#interface G1/0/3
sw1(config-if)#switchport mode trunk

sw2(config)#interface G1/0/1
sw2(config-if)#switchport mode trunk
```

划分两个 Vlan， Vlan 10 和 Vlan 20

```cmd
sw1(config)#vlan 10
sw2(config)#vlan 20
```

分别将 SW1 和 SW2 的 `G1/0/1` 口划分入 `Vlan 10`， `G1/0/2` 口划分入 `Vlan 20`。

```cmd
sw1(config)#interface G1/0/1
sw1(config-if)#switchport mode access
sw1(config-if)#swichport access vlan 10
sw1(config-if)#exit
sw1(config)#interface G1/0/2
sw1(config-if)#switchport mode access
sw1(config-if)#switchport access vlan 20
sw1(config)#interface G1/0/4
sw1(config-if)#switchport mode access
sw1(config-if)#switchport access vlan 30
```

sw2同理 

```cmd
sw2(config)#interface G1/0/2
sw2(config-if)#switchport mode access
sw2(config-if)#swichport access vlan 10
sw2(config-if)#exit
sw2(config)#interface G1/0/3
sw2(config-if)#switchport mode access
sw2(config-if)#switchport access vlan 20
```

将 sw1 的 `G1/0/5` 设置 trunk , 与路由器互联

```cmd
sw1(config)#interface G1/0/5
sw1(config-if)#switchport mode trunk
```

Router 的 `G1/0/0` 口需要划分两个子接口，分别对应 Vlan10 和 Vlan20，作为它们的网关。

```cmd
R0(config)#interface G0/0/0
R0(config-if)#no ip address
R0(config-if)#no shutdown
R0(config)#int G0/0/0.10
R0(config-if)#encapsulation dot1q 10
R0(config-if)#ip address 192.168.10.1 255.255.255.0
R0(config)#int G0/0/0.20
R0(config-if)#encapsulation dot1q 20
R0(config-if)#ip address 192.168.20.1 255.255.255.0
R0(config)#interface G0/0/0.30
R0(config-if)#encapsulation dot1q 30
R0(config-if)#ip address 192.168.3.1 255.255.255.0
```

接下来配置四台PC 的主机IP

| 主机 | IP           | 子网掩码      | 默认网关     |
| ---- | ------------ | ------------- | ------------ |
| PC1  | 192.168.10.2 | 255.255.255.0 | 192.168.10.1 |
| PC2  | 192.168.20.2 | 255.255.255.0 | 192.168.20.1 |
| PC3  | 192.168.10.3 | 255.255.255.0 | 192.168.10.1 |
| PC4  | 192.168.20.3 | 255.255.255.0 | 192.168.20.1 |

让 PC1 来 ping PC2 , 

`ping from 192.168.10.2 to 192.168.20.2`

```cmd
PC1> ping 192.168.20.2
```

#### 2.2 动态路由协议RIP

配置 IP

```cmd
R1(config)#interface S0/1/0
R1(config-if)#ip address 192.168.1.1 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#clock rate 64000
R1(config)#interface g0/0/0
R1(config-if)#ip address 192.168.3.2 255.255.255.0
R1(config-if)#no shutdown

R2(config)#interface serial 0/1/0
R2(config-if)#ip address 192.168.1.2 255.255.255.0
R2(config-if)#no shutdown
R2(config)#interface serial 0/1/1
R2(config-if)#ip address 192.168.2.2 255.255.255.0
R2(config-if)#no shutdown

R3(config)#interface serial 0/1/0
R3(config-if)#ip address 192.168.2.1 255.255.255.0
R3(config-if)#no shutdown
```

配置RIP

```cmd
R0(config)#router rip
R0(config)#network 192.168.3.0
R0(config)#network 192.168.10.0
R0(config)#network 192.168.20.0

R1(config)#router rip
R1(config)#network 192.168.3.0
R1(config)#network 192.168.1.0

R2(config)#router rip
R2(config)#network 192.168.1.0
R2(config)#network 192.168.2.0

R3(config)#router rip
R3(config)#network 192.168.2.0
```

#### 2.3 ACL

在 `R2` 上配置ACL，限制主机192.168.2.1发送到192.168.1.1的分组

```cmd
R2(config)#access-l 100 deny icmp host 192.168.2.1 host 192.168.1.1
R2(config)#access-l 100 permit ip any any
R2(config)#interface serial 0/1/1
R2(config-if)#ip access-group 100 in
```

#### 
